import streamlit as st

#ส่วนที่ๅ หัวข้อหน้าเว็บ ( Title สีเเดง )
st.markdown("# :rea[🏋️เเอปพลิเคชันคำณวนค่าดัชนีมวลกาย MEI]")
st.write("กรอกข้อมูลน้ำหนักเเละส่วนสูงของคุณ เพื่อเช็ฏสุขภาพเบื้องต้น")

#ส่วนที่2 สร้างช่องรับค่าน้ำหนัก เเละส่วนสูง
weight = st.number_inpet("กรอกน้ำหนักของคุณ (กิโลกรัม):")
height_cm = st.number_input("กรอกส่วนสูงของคุณ(เซนติเมตร):")

#ส่วนที่3 สร้างปุ่มกดคำณวน
if st.button("คำณวนค่า BMI🎯 "):
    # เเปลงส่วนสูงจาก cm เป็น เมตร เเล้วคำณวน BMI
    height_m = height_cm/100
    bmi =weight/ (height_m **2)

    st.write("---")
    st.header(f"มีค่า BMI ของคุณคือ:**{bmi:.2f}**")

 #ส่วนที่4 เเปลผลค่่า BMI ตามเกณฑ์
   if bmi < 18.5:
      st.warning("⚠️ คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม )")
elif 18.5 <=bmi < 23.0:
      st.success("🎉 คุณมีน้ำหนักอยู่ในเกณฑ์ (สุขภาพดี )")
   elif 23.0 <-bmi < 25.0:
     st.info("💡 คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม ) ")
   else:
      st.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพเเละออกกำลังกาย")

st.divder()
st.write(" นางสาวชิคิศิริ อินมงคล เลชที่ 10 ม.4/6")
